# Data Question 1: An Exploration of UN data

In [1]:
### Import packages
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import scipy.stats as stats
import statsmodels.api as sm

### plots show in the notebook without having to call plt.show() every time

%matplotlib inline

In [2]:
gdp_df = pd.read_csv('../data/gdp_per_capita.csv')

In [3]:
### Take a look at the first 10 rows.
gdp_df.head(10)

  Country or Area  Year        Value  Value Footnotes
0     Afghanistan  2018  1734.723214              NaN
1     Afghanistan  2017  1758.465636              NaN
2     Afghanistan  2016  1757.023490              NaN
3     Afghanistan  2015  1766.593077              NaN
4     Afghanistan  2014  1795.735834              NaN
5     Afghanistan  2013  1807.762344              NaN
6     Afghanistan  2012  1772.764974              NaN
7     Afghanistan  2011  1626.764793              NaN
8     Afghanistan  2010  1671.581238              NaN
9     Afghanistan  2009  1502.354073              NaN

In [4]:
### Look at the last 5 rows. Do you see a problem?
gdp_df.tail(5)

,Country or Area,Year,Value,Value Footnotes
6726,Zimbabwe,1992,2591.007534,NaN
6727,Zimbabwe,1991,2906.272849,NaN
6728,Zimbabwe,1990,2819.549467,NaN
6729,footnoteSeqID,Footnote,NaN,NaN
6730,2,"Excludes South Sudan after July 9, 2011.",NaN,NaN

In [5]:
### Redo the read_csv() call to correct this issue - do not modify the original csv file.
gdp_df = pd.read_csv('../data/gdp_per_capita.csv')[:-2]

In [6]:
gdp_df.tail(5)

     Country or Area  Year        Value  Value Footnotes
6724        Zimbabwe  1994  2768.309953              NaN
6725        Zimbabwe  1993  2572.870395              NaN
6726        Zimbabwe  1992  2591.007534              NaN
6727        Zimbabwe  1991  2906.272849              NaN
6728        Zimbabwe  1990  2819.549467              NaN

In [7]:
### and rename the remaining columns to ‘Country’, ‘Year’, and ‘GDP_Per_Capita’.
gdp_df.rename(columns = {'Country or Area':'Country', 'Year':'Year', 'Value':'GDP_Per_Capita'}, inplace = True)
gdp_df.head(5)

       Country  Year  GDP_Per_Capita  Value Footnotes
0  Afghanistan  2018     1734.723214              NaN
1  Afghanistan  2017     1758.465636              NaN
2  Afghanistan  2016     1757.023490              NaN
3  Afghanistan  2015     1766.593077              NaN
4  Afghanistan  2014     1795.735834              NaN

In [8]:
### Drop the ‘Value Footnotes’ column (axis=1 for columns and axis=0 for rows)
gdp_df =gdp_df.drop(['Value Footnotes'], axis=1)
gdp_df.head(5)

       Country  Year  GDP_Per_Capita
0  Afghanistan  2018     1734.723214
1  Afghanistan  2017     1758.465636
2  Afghanistan  2016     1757.023490
3  Afghanistan  2015     1766.593077
4  Afghanistan  2014     1795.735834

In [9]:
### How many rows and columns does gdp_df have?
gdp_df.shape

(6729, 3)

In [11]:
### What are the data types of its columns?
gdp_df.dtypes

Country            object
Year               object
GDP_Per_Capita    float64
dtype: object

In [13]:
### If any of the columns are not the expected types, figure out why and fix it.
gdp_df['Year'] = pd.to_numeric(gdp_df['Year'])

In [14]:
gdp_df.dtypes

Country            object
Year                int64
GDP_Per_Capita    float64
dtype: object

In [19]:
### 8. Which years are represented in this dataset? Take a look at the number of observations per year. What do you notice?
gdp_df['Year'].value_counts().sort_index()

1990    210
1991    211
1992    213
1993    215
1994    218
1995    224
1996    224
1997    226
1998    227
1999    228
2000    236
2001    237
2002    238
2003    238
2004    238
2005    238
2006    238
2007    239
2008    240
2009    241
2010    241
2011    243
2012    241
2013    241
2014    240
2015    240
2016    239
2017    239
2018    226
Name: Year, dtype: int64

In [23]:
### 9. How many countries are represented in this dataset? Which countries are least represented in the dataset? Why do you think these countries have so few observations?
gdp_df['Country'].unique

<bound method Series.unique of 0       Afghanistan
1       Afghanistan
2       Afghanistan
3       Afghanistan
4       Afghanistan
5       Afghanistan
6       Afghanistan
7       Afghanistan
8       Afghanistan
9       Afghanistan
10      Afghanistan
11      Afghanistan
12      Afghanistan
13      Afghanistan
14      Afghanistan
15      Afghanistan
16      Afghanistan
17          Albania
18          Albania
19          Albania
20          Albania
21          Albania
22          Albania
23          Albania
24          Albania
25          Albania
26          Albania
27          Albania
28          Albania
29          Albania
           ...
6699         Zambia
6700       Zimbabwe
6701       Zimbabwe
6702       Zimbabwe
6703       Zimbabwe
6704       Zimbabwe
6705       Zimbabwe
6706       Zimbabwe
6707       Zimbabwe
6708       Zimbabwe
6709       Zimbabwe
6710       Zimbabwe
6711       Zimbabwe
6712       Zimbabwe
6713       Zimbabwe
6714       Zimbabwe
6715       Zimbabwe
6716       Zimbabwe
6717       Zimbabwe
6718       Zimbabwe
6719       Zimbabwe
6720       Zimbabwe
6721       Zimbabwe
6722       Zimbabwe
6723       Zimbabwe
6724       Zimbabwe
6725       Zimbabwe
6726       Zimbabwe
6727       Zimbabwe
6728       Zimbabwe
Name: Country, Length: 6729, dtype: object>